brew "awscli"
brew "bat"
brew "ca-certificates"
brew "chezmoi"
brew "cocoapods"
brew "direnv"
brew "dockutil"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "mise"
brew "ripgrep"
brew "smartmontools"
brew "starship"
brew "tmux"
brew "zinit"
brew "zoxide"

if OS.mac?
  brew "android-commandlinetools"

  cask "font-maple-mono-nf-cn"
  cask "google-chrome"
  cask "iterm2"
  cask "monitorcontrol"
  # Optional Docker Desktop alternative. Install when a project needs Docker.
  # cask "orbstack"
  cask "raycast"
  cask "rectangle"
  cask "stats"
  cask "tailscale-app"
  cask "visual-studio-code"

  # Optional but useful for 4K/HiDPI tuning. Uncomment if macOS scaling feels off.
  # cask "betterdisplay"
end
